app/controllers/books_controller.rb

UPDATE "books" SET "title" = ?, "author" = ?, "description" = ?, "numChapters" = ?, "status" = ?, "updated_at" = ? WHERE "books"."id" = ?
---
  def update
    respond_to do |format|
      if @book.update(book_params)