app/controllers/pages_controller.rb

  def home
    @books = Book.all
---
SELECT "books".* FROM "books"